# Pre-processamento

In [1]:
import pandas as pd

In [17]:
df = pd.read_csv('exemplo.csv')

In [18]:
df

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN
3   NaN   NaN   NaN  NaN
4   2.0   3.0   1.0  5.0

## Checagem de valores nulos / faltantes

In [19]:
# df.isnull()
df.isna()

       A      B      C      D
0  False  False  False  False
1  False  False   True  False
2  False  False  False   True
3   True   True   True   True
4  False  False  False  False

In [20]:
df.isna().sum()

A    1
B    1
C    2
D    2
dtype: int64

## Eliminar amostras com valores faltantes

In [21]:
#df.dropna(axis=0, inplace=True) # inplace altera o df original
df.dropna(axis=0)

     A    B    C    D
0  1.0  2.0  3.0  4.0
4  2.0  3.0  1.0  5.0

## Eliminar features com valores faltantes

In [22]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [23]:
# elimina linha com todos os valores faltantes
df.dropna(how='all')

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN
4   2.0   3.0   1.0  5.0

In [25]:
df.dropna(thresh=2)

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN
4   2.0   3.0   1.0  5.0

In [26]:
df.dropna(subset=['C'])

      A     B     C    D
0   1.0   2.0   3.0  4.0
2  10.0  11.0  12.0  NaN
4   2.0   3.0   1.0  5.0

In [29]:
df.drop(labels=[0, 1])

      A     B     C    D
2  10.0  11.0  12.0  NaN
3   NaN   NaN   NaN  NaN
4   2.0   3.0   1.0  5.0

In [30]:
df.drop(labels=['A', 'C'], axis=1)

      B    D
0   2.0  4.0
1   6.0  8.0
2  11.0  NaN
3   NaN  NaN
4   3.0  5.0

## Assinalar valores aos faltantes

In [31]:
from sklearn.preprocessing import Imputer

In [33]:
df_ = df.dropna(how='all')

In [36]:
# aqui o eixo 0 é o eixo das colunas
prep = Imputer(missing_values='NaN', strategy='mean', axis=0)
prep = prep.fit(df_)
dados = prep.transform(df_)
dados

array([[ 1.        ,  2.        ,  3.        ,  4.        ],
       [ 5.        ,  6.        ,  5.33333333,  8.        ],
       [10.        , 11.        , 12.        ,  5.66666667],
       [ 2.        ,  3.        ,  1.        ,  5.        ]])

In [40]:
# Se desejar recriar um dataframe
# pd.DataFrame(dados, columns=df_.columns)

/bin/sh: conda: command not found

In [47]:
df2 = pd.read_excel('planilha1.xlsx')

In [48]:
df2

   color size  price   label
0  green    M   10.1  class1
1    red    L   13.5  class2
2   blue   XL   15.3  class1